<a href="https://colab.research.google.com/github/dwijamahardika/KNearestNeighbor_Implementation/blob/main/k_nearest_neighbor.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import math

In [ ]:
df_train = pd.read_excel('data_train.xlsx')
df_train = df_train.drop(['Unnamed: 0'], axis=1)
df_test = pd.read_excel('data_test.xlsx')
df_test = df_test.drop(['Unnamed: 0'], axis=1)

In [ ]:
df_train.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15694829  Female   32           150000          1
1  15733883    Male   47            25000          1
2  15617482    Male   45            26000          1
3  15704583    Male   46            28000          1
4  15621083  Female   48            29000          1

In [ ]:
df_test.head()

    User ID  Gender  Age  EstimatedSalary
0  15609669  Female   59            88000
1  15685536    Male   35            61000
2  15750447    Male   37            70000
3  15663249  Female   52            21000
4  15638646    Male   48           141000

In [ ]:
jarak = []
for i in range(len(df_test)):
  euclidean = {}
  for j in range(len(df_train)):
    euclidean[j] = math.sqrt( (df_test['Age'].loc[i] - df_train['Age'].loc[j])**2 + ((df_test['EstimatedSalary'].loc[i]/1000) - (df_train['EstimatedSalary'].loc[j]/1000))**2 )
  jarak.append(euclidean)

In [ ]:
k = 5
file = open("result.txt", "w")
pertama = True
for i in range(len(df_test)):
  nol = 0
  satu = 0
  id = str(df_test['User ID'].loc[i])
  terdekat = str(min(jarak[i], key=jarak[i].get))
  for j in range(k):
    purchase = df_train['Purchased'].loc[min(jarak[i], key=jarak[i].get)]
    if purchase == 0:
      nol += 1
    else:
      satu += 1
    euclidean[min(jarak[i], key=jarak[i].get)] += 10000
  for i in range(k):
    euclidean[max(jarak[i], key=jarak[i].get)] -= 10000
  if satu > nol:
    if not pertama:
      file.write(", \n")
    file.write(id)
    if pertama:
      pertama = False